<a href="https://colab.research.google.com/github/jeetri8here/Machine-Learning/blob/master/data_manipulation.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Data Exploration With pandas

## **When we are performing any type of analysis we need to have some evidence in a data which can help us to guide or helps us to make model accurate is called data Exploration. To find this evidences we need to ask some questions to yourself. Such as follows**

• How big is our dataset?
• How many features do we have?
• Is any record corrupted or missing information for one or more features?
• Are the features numbers or categories?
• How is each feature distributed? Are they correlated?

Pandas is the library which helps to perform Data Explorations

There are many other libraries as well (https://pypi.org/search/?q=data+Exploration+Libraries) but pandas is a popular one and easy to use.

In [2]:
import pandas as pd

In [2]:
#defining dataset parameter using pandas 
pd.set_option("display.max_rows", 13)
pd.set_option("display.max_columns", 7)
pd.set_option("display.latex.repr", True)
pd.set_option('max_colwidth', 30)

In [5]:
df= pd.read_csv("titanic-train.csv") #Reading Data

For Reading Different types of file extension Follow (https://pandas.pydata.org/docs/user_guide/io.html)

In [6]:
df.head() #observing the data

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [7]:
df.info() #checking out the missing values and data type of the columns

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [8]:
df.describe()

       PassengerId    Survived      Pclass  ...       SibSp       Parch        Fare
count   891.000000  891.000000  891.000000  ...  891.000000  891.000000  891.000000
mean    446.000000    0.383838    2.308642  ...    0.523008    0.381594   32.204208
std     257.353842    0.486592    0.836071  ...    1.102743    0.806057   49.693429
min       1.000000    0.000000    1.000000  ...    0.000000    0.000000    0.000000
25%     223.500000    0.000000    2.000000  ...    0.000000    0.000000    7.910400
50%     446.000000    0.000000    3.000000  ...    0.000000    0.000000   14.454200
75%     668.500000    1.000000    3.000000  ...    1.000000    0.000000   31.000000
max     891.000000    1.000000    3.000000  ...    8.000000    6.000000  512.329200

[8 rows x 7 columns]

In [9]:
df.iloc[3]

PassengerId                                               4
Survived                                                  1
Pclass                                                    1
Name           Futrelle, Mrs. Jacques Heath (Lily May Peel)
Sex                                                  female
Age                                                      35
SibSp                                                     1
Parch                                                     0
Ticket                                               113803
Fare                                                   53.1
Cabin                                                  C123
Embarked                                                  S
Name: 3, dtype: object

In [10]:
df.loc[0:3,"Ticket"]

0           A/5 21171
1            PC 17599
2    STON/O2. 3101282
3              113803
Name: Ticket, dtype: object

In [11]:
df["Ticket"].head()

0           A/5 21171
1            PC 17599
2    STON/O2. 3101282
3              113803
4              373450
Name: Ticket, dtype: object

In [12]:
df[['Embarked', 'Ticket']].head()

  Embarked            Ticket
0        S         A/5 21171
1        C          PC 17599
2        S  STON/O2. 3101282
3        S            113803
4        S            373450

In [13]:
df[df['Age'] > 70]

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
96            97         0       1  ...  34.6542    A5         C
116          117         0       3  ...   7.7500   NaN         Q
493          494         0       1  ...  49.5042   NaN         C
630          631         1       1  ...  30.0000   A23         S
851          852         0       3  ...   7.7750   NaN         S

[5 rows x 12 columns]

In [14]:
len(df['Age'] > 70)

891

In [15]:
df.query("Age > 70")

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
96            97         0       1  ...  34.6542    A5         C
116          117         0       3  ...   7.7500   NaN         Q
493          494         0       1  ...  49.5042   NaN         C
630          631         1       1  ...  30.0000   A23         S
851          852         0       3  ...   7.7750   NaN         S

[5 rows x 12 columns]

In [16]:
df[(df['Age'] == 11) & (df['SibSp'] == 5)]

    PassengerId  Survived  Pclass  ...  Fare Cabin  Embarked
59           60         0       3  ...  46.9   NaN         S

[1 rows x 12 columns]

In [17]:
df.query('(Age == 11) | (SibSp == 5)')

     PassengerId  Survived  Pclass  ...      Fare    Cabin  Embarked
59            60         0       3  ...   46.9000      NaN         S
71            72         0       3  ...   46.9000      NaN         S
386          387         0       3  ...   46.9000      NaN         S
480          481         0       3  ...   46.9000      NaN         S
542          543         0       3  ...   31.2750      NaN         S
683          684         0       3  ...   46.9000      NaN         S
731          732         0       3  ...   18.7875      NaN         C
802          803         1       1  ...  120.0000  B96 B98         S

[8 rows x 12 columns]

In [18]:
df['Embarked'].unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [19]:

df.sort_values('Age', ascending = False).head()

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
630          631         1       1  ...  30.0000   A23         S
851          852         0       3  ...   7.7750   NaN         S
493          494         0       1  ...  49.5042   NaN         C
96            97         0       1  ...  34.6542    A5         C
116          117         0       3  ...   7.7500   NaN         Q

[5 rows x 12 columns]

In [20]:
df.sort_values('PassengerId', ascending = False).head()

     PassengerId  Survived  Pclass  ...   Fare Cabin  Embarked
890          891         0       3  ...   7.75   NaN         Q
889          890         1       1  ...  30.00  C148         C
888          889         0       3  ...  23.45   NaN         S
887          888         1       1  ...  30.00   B42         S
886          887         0       2  ...  13.00   NaN         S

[5 rows x 12 columns]

In [21]:
df['Survived'].value_counts()

0    549
1    342
Name: Survived, dtype: int64

In [22]:
df['Sex'].value_counts()

male      577
female    314
Name: Sex, dtype: int64

In [23]:
df.groupby(['Pclass','Survived'])['PassengerId'].count()

Pclass  Survived
1       0            80
        1           136
2       0            97
        1            87
3       0           372
        1           119
Name: PassengerId, dtype: int64

In [24]:
df['Age'].min()

0.42

In [25]:
df['Age'].max()

80.0

In [26]:
df['Age'].mean()

29.69911764705882

In [27]:
df['Age'].median()

28.0

In [28]:
mean_age_by_surv = df.groupby('Survived')['Age'].mean()
mean_age_by_surv

Survived
0    30.626179
1    28.343690
Name: Age, dtype: float64

In [29]:
std_age_by_survived = df.groupby('Survived')['Age'].std()
std_age_by_survived

Survived
0    14.172110
1    14.950952
Name: Age, dtype: float64

In [30]:
df1 = mean_age_by_surv.round(0).reset_index()
df1

   Survived   Age
0         0  31.0
1         1  28.0

In [31]:
df2 = std_age_by_survived.round(0).reset_index()
df2

   Survived   Age
0         0  14.0
1         1  15.0

In [32]:
df3 = pd.merge(df1, df2, on='Survived')
df3

   Survived  Age_x  Age_y
0         0   31.0   14.0
1         1   28.0   15.0

In [33]:
df3.columns = ['Survived',
'Average Age',
'Age Standard Deviation']
df3

   Survived  Average Age  Age Standard Deviation
0         0         31.0                    14.0
1         1         28.0                    15.0

In [34]:
df.pivot_table(index='Pclass',
columns='Survived',
values='PassengerId',
aggfunc='count')

Survived    0    1
Pclass
1          80  136
2          97   87
3         372  119

In [35]:
df['IsFemale'] = df['Sex'] == 'female'

In [36]:
corr_w_surv = df.corr()['Survived'].sort_values()
corr_w_surv

Pclass        -0.338481
Age           -0.077221
SibSp         -0.035322
PassengerId   -0.005007
Parch          0.081629
Fare           0.257307
IsFemale       0.543351
Survived       1.000000
Name: Survived, dtype: float64